Autodesk.Revit.DB.View3D.SetRenderingSettings(Autodesk.Revit.DB.RenderingSettings)
Changes the mental ray rendering settings for this 3d view.
settings:
The new rendering settings to be applied to this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View3D.GetRenderingSettings
Returns the current mental ray rendering settings for this 3d view.
Returns:
The returned object represents the current mental ray rendering settings.
If you change the returned object, you need to call SetRenderingSettings to apply the new settings back to Revit.
Since:
2013